Revit 2024 API
ExternalServices.BuiltInExternalServices.ExternalDataManagerService Property
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ExternalServiceId ExternalDataManagerService { get; }
Visual Basic
Public Shared ReadOnly Property ExternalDataManagerService As ExternalServiceId
	Get
Visual C++
public:
static property ExternalServiceId^ ExternalDataManagerService {
	ExternalServiceId^ get ();
}
See Also
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace